Revit.Elements.CurveElement.InternalSetCurve(Autodesk.Revit.DB.Curve)
Set the geometry curve used by the ModelCurve
c:

Revit.Elements.CurveElement.InternalSetCurveElement(Autodesk.Revit.DB.CurveElement)
Set the internal model curve along with its id's
curveElement:

Revit.Elements.CurveElement.InternalCurveElement
Reference to the Element

Revit.Elements.CurveElement.ElementCurveReference
Obtain the reference curve for this ModelCurve

Revit.Elements.CurveElement.Curve
Obtain the geometry curve for this geometry curve